========================================================================================================================================================================================================
Layer (type:depth-idx)                                                      Input Shape               Output Shape              Param #                   Kernel Shape              Mult-Adds
========================================================================================================================================================================================================
ResidualEncoderUNet                                                         [20, 1, 64, 128, 128]     [20, 2, 64, 128, 128]     --                        --                        --
├─UNetDecoder: 1-1                                                          --                        --                        (recursive)               --                        --
│    └─ResidualEncoder: 2-1                                                 [20, 1, 64, 128, 128]     [20, 32, 64, 128, 128]    --                        --                        --
│    │    └─StackedConvBlocks: 3-1                                          [20, 1, 64, 128, 128]     [20, 32, 64, 128, 128]    --                        --                        --
│    │    │    └─Sequential: 4-1                                            [20, 1, 64, 128, 128]     [20, 32, 64, 128, 128]    960                       --                        18,790,483,200
│    │    └─Sequential: 3-2                                                 --                        --                        --                        --                        --
│    │    │    └─StackedResidualBlocks: 4-2                                 [20, 32, 64, 128, 128]    [20, 32, 64, 128, 128]    110,976                   --                        2,321,966,699,520
│    │    │    └─StackedResidualBlocks: 4-3                                 [20, 32, 64, 128, 128]    [20, 64, 32, 64, 64]      390,016                   --                        1,020,725,834,240
│    │    │    └─StackedResidualBlocks: 4-4                                 [20, 64, 32, 64, 64]      [20, 128, 16, 32, 32]     1,558,272                 --                        510,195,164,160
│    │    │    └─StackedResidualBlocks: 4-5                                 [20, 128, 16, 32, 32]     [20, 256, 8, 16, 16]      6,229,504                 --                        255,055,677,440
│    │    │    └─StackedResidualBlocks: 4-6                                 [20, 256, 8, 16, 16]      [20, 512, 4, 8, 8]        24,910,848                --                        127,517,429,760
│    │    │    └─StackedResidualBlocks: 4-7                                 [20, 512, 4, 8, 8]        [20, 512, 4, 4, 4]        28,317,696                --                        36,241,489,920
├─UNetDecoder: 1-2                                                          [20, 32, 64, 128, 128]    [20, 2, 64, 128, 128]     61,518,272                --                        --
│    └─ModuleList: 2-14                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-3                                            [20, 512, 4, 4, 4]        [20, 512, 4, 8, 8]        1,049,088                 [1, 2, 2]                 5,371,330,560
│    └─ModuleList: 2-15                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-4                                          [20, 1024, 4, 8, 8]       [20, 512, 4, 8, 8]        --                        --                        --
│    │    │    └─Sequential: 4-8                                            [20, 1024, 4, 8, 8]       [20, 512, 4, 8, 8]        21,236,736                --                        108,721,643,520
│    └─ModuleList: 2-16                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-5                                                     [20, 512, 4, 8, 8]        [20, 2, 4, 8, 8]          1,026                     [1, 1, 1]                 5,253,120
│    └─ModuleList: 2-14                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-6                                            [20, 512, 4, 8, 8]        [20, 256, 8, 16, 16]      1,048,832                 [2, 2, 2]                 42,960,158,720
│    └─ModuleList: 2-15                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-7                                          [20, 512, 8, 16, 16]      [20, 256, 8, 16, 16]      --                        --                        --
│    │    │    └─Sequential: 4-9                                            [20, 512, 8, 16, 16]      [20, 256, 8, 16, 16]      5,309,952                 --                        217,453,711,360
│    └─ModuleList: 2-16                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-8                                                     [20, 256, 8, 16, 16]      [20, 2, 8, 16, 16]        514                       [1, 1, 1]                 21,053,440
│    └─ModuleList: 2-14                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-9                                            [20, 256, 8, 16, 16]      [20, 128, 16, 32, 32]     262,272                   [2, 2, 2]                 85,941,288,960
│    └─ModuleList: 2-15                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-10                                         [20, 256, 16, 32, 32]     [20, 128, 16, 32, 32]     --                        --                        --
│    │    │    └─Sequential: 4-10                                           [20, 256, 16, 32, 32]     [20, 128, 16, 32, 32]     1,327,872                 --                        434,949,335,040
│    └─ModuleList: 2-16                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-11                                                    [20, 128, 16, 32, 32]     [20, 2, 16, 32, 32]       258                       [1, 1, 1]                 84,541,440
│    └─ModuleList: 2-14                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-12                                           [20, 128, 16, 32, 32]     [20, 64, 32, 64, 64]      65,600                    [2, 2, 2]                 171,966,464,000
│    └─ModuleList: 2-15                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-13                                         [20, 128, 32, 64, 64]     [20, 64, 32, 64, 64]      --                        --                        --
│    │    │    └─Sequential: 4-11                                           [20, 128, 32, 64, 64]     [20, 64, 32, 64, 64]      332,160                   --                        870,066,426,880
│    └─ModuleList: 2-16                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-14                                                    [20, 64, 32, 64, 64]      [20, 2, 32, 64, 64]       130                       [1, 1, 1]                 340,787,200
│    └─ModuleList: 2-14                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-15                                           [20, 64, 32, 64, 64]      [20, 32, 64, 128, 128]    16,416                    [2, 2, 2]                 344,268,472,320
│    └─ModuleList: 2-15                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-16                                         [20, 64, 64, 128, 128]    [20, 32, 64, 128, 128]    --                        --                        --
│    │    │    └─Sequential: 4-12                                           [20, 64, 64, 128, 128]    [20, 32, 64, 128, 128]    83,136                    --                        1,740,803,934,720
│    └─ModuleList: 2-16                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-17                                                    [20, 32, 64, 128, 128]    [20, 2, 64, 128, 128]     66                        [1, 1, 1]                 1,384,120,320
========================================================================================================================================================================================================
Total params: 153,770,602
Trainable params: 153,770,602
Non-trainable params: 0
Total mult-adds (T): 8.31
========================================================================================================================================================================================================
Input size (MB): 83.89
Forward/backward pass size (MB): 107694.74
Params size (MB): 369.01
Estimated Total Size (MB): 108147.63
========================================================================================================================================================================================================