========================================================================================================================================================================================================
Layer (type:depth-idx)                                                      Input Shape               Output Shape              Param #                   Kernel Shape              Mult-Adds
========================================================================================================================================================================================================
ResidualEncoderUNet                                                         [4, 1, 96, 256, 256]      [4, 2, 96, 256, 256]      --                        --                        --
├─UNetDecoder: 1-1                                                          --                        --                        (recursive)               --                        --
│    └─ResidualEncoder: 2-1                                                 [4, 1, 96, 256, 256]      [4, 32, 96, 256, 256]     --                        --                        --
│    │    └─StackedConvBlocks: 3-1                                          [4, 1, 96, 256, 256]      [4, 32, 96, 256, 256]     --                        --                        --
│    │    │    └─Sequential: 4-1                                            [4, 1, 96, 256, 256]      [4, 32, 96, 256, 256]     960                       --                        22,548,578,560
│    │    └─Sequential: 3-2                                                 --                        --                        --                        --                        --
│    │    │    └─StackedResidualBlocks: 4-2                                 [4, 32, 96, 256, 256]     [4, 32, 96, 256, 256]     110,976                   --                        2,786,360,034,304
│    │    │    └─StackedResidualBlocks: 4-3                                 [4, 32, 96, 256, 256]     [4, 64, 48, 128, 128]     390,016                   --                        1,224,870,988,288
│    │    │    └─StackedResidualBlocks: 4-4                                 [4, 64, 48, 128, 128]     [4, 128, 24, 64, 64]      1,558,272                 --                        612,234,171,392
│    │    │    └─StackedResidualBlocks: 4-5                                 [4, 128, 24, 64, 64]      [4, 256, 12, 32, 32]      6,229,504                 --                        306,066,761,728
│    │    │    └─StackedResidualBlocks: 4-6                                 [4, 256, 12, 32, 32]      [4, 512, 6, 16, 16]       24,910,848                --                        153,020,813,312
│    │    │    └─StackedResidualBlocks: 4-7                                 [4, 512, 6, 16, 16]       [4, 512, 6, 8, 8]         28,317,696                --                        43,489,705,984
├─UNetDecoder: 1-2                                                          [4, 32, 96, 256, 256]     [4, 2, 96, 256, 256]      61,518,272                --                        --
│    └─ModuleList: 2-14                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-3                                            [4, 512, 6, 8, 8]         [4, 512, 6, 16, 16]       1,049,088                 [1, 2, 2]                 6,445,596,672
│    └─ModuleList: 2-15                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-4                                          [4, 1024, 6, 16, 16]      [4, 512, 6, 16, 16]       --                        --                        --
│    │    │    └─Sequential: 4-8                                            [4, 1024, 6, 16, 16]      [4, 512, 6, 16, 16]       21,236,736                --                        130,465,931,264
│    └─ModuleList: 2-16                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-5                                                     [4, 512, 6, 16, 16]       [4, 2, 6, 16, 16]         1,026                     [1, 1, 1]                 6,303,744
│    └─ModuleList: 2-14                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-6                                            [4, 512, 6, 16, 16]       [4, 256, 12, 32, 32]      1,048,832                 [2, 2, 2]                 51,552,190,464
│    └─ModuleList: 2-15                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-7                                          [4, 512, 12, 32, 32]      [4, 256, 12, 32, 32]      --                        --                        --
│    │    │    └─Sequential: 4-9                                            [4, 512, 12, 32, 32]      [4, 256, 12, 32, 32]      5,309,952                 --                        260,944,433,152
│    └─ModuleList: 2-16                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-8                                                     [4, 256, 12, 32, 32]      [4, 2, 12, 32, 32]        514                       [1, 1, 1]                 25,264,128
│    └─ModuleList: 2-14                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-9                                            [4, 256, 12, 32, 32]      [4, 128, 24, 64, 64]      262,272                   [2, 2, 2]                 103,129,546,752
│    └─ModuleList: 2-15                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-10                                         [4, 256, 24, 64, 64]      [4, 128, 24, 64, 64]      --                        --                        --
│    │    │    └─Sequential: 4-10                                           [4, 256, 24, 64, 64]      [4, 128, 24, 64, 64]      1,327,872                 --                        521,939,191,808
│    └─ModuleList: 2-16                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-11                                                    [4, 128, 24, 64, 64]      [4, 2, 24, 64, 64]        258                       [1, 1, 1]                 101,449,728
│    └─ModuleList: 2-14                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-12                                           [4, 128, 24, 64, 64]      [4, 64, 48, 128, 128]     65,600                    [2, 2, 2]                 206,359,756,800
│    └─ModuleList: 2-15                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-13                                         [4, 128, 48, 128, 128]    [4, 64, 48, 128, 128]     --                        --                        --
│    │    │    └─Sequential: 4-11                                           [4, 128, 48, 128, 128]    [4, 64, 48, 128, 128]     332,160                   --                        1,044,079,707,136
│    └─ModuleList: 2-16                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-14                                                    [4, 64, 48, 128, 128]     [4, 2, 48, 128, 128]      130                       [1, 1, 1]                 408,944,640
│    └─ModuleList: 2-14                                                     --                        --                        (recursive)               --                        --
│    │    └─ConvTranspose3d: 3-15                                           [4, 64, 48, 128, 128]     [4, 32, 96, 256, 256]     16,416                    [2, 2, 2]                 413,122,166,784
│    └─ModuleList: 2-15                                                     --                        --                        (recursive)               --                        --
│    │    └─StackedConvBlocks: 3-16                                         [4, 64, 96, 256, 256]     [4, 32, 96, 256, 256]     --                        --                        --
│    │    │    └─Sequential: 4-12                                           [4, 64, 96, 256, 256]     [4, 32, 96, 256, 256]     83,136                    --                        2,088,964,719,104
│    └─ModuleList: 2-16                                                     --                        --                        (recursive)               --                        --
│    │    └─Conv3d: 3-17                                                    [4, 32, 96, 256, 256]     [4, 2, 96, 256, 256]      66                        [1, 1, 1]                 1,660,944,384
========================================================================================================================================================================================================
Total params: 153,770,602
Trainable params: 153,770,602
Non-trainable params: 0
Total mult-adds (T): 9.98
========================================================================================================================================================================================================
Input size (MB): 100.66
Forward/backward pass size (MB): 129233.68
Params size (MB): 369.01
Estimated Total Size (MB): 129703.36
========================================================================================================================================================================================================